tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "universal-ctags/universal-ctags"

# Languages
brew "go"
brew "lua"
brew "node"
brew "python"
brew "ruby"

# Dev stuff
brew "ansible"
brew "direnv"
brew "cloc"
brew "cmake"
brew "git"
brew "git-extras"
brew "jq"
brew "jsonpp"
brew "macvim", args: ["with-override-system-vim", "HEAD"]
brew "make"
brew "pyenv"
brew "pyenv-virtualenv"
brew "shellcheck"
brew "tmux"
brew "hadolint"  # Dockerfile linter
brew "universal-ctags", args: ["HEAD"]
brew "zsh"

# Utilities
brew "archey"
brew "ffmpeg"
brew "fswatch"
brew "graphviz"
brew "gnupg"
brew "htop"
brew "iftop" # Bandwidth usage on an interface
brew "iperf3"
brew "mkvtoolnix"
brew "mtr" # Combines traceroute and ping into a nice curses interface
brew "nmap"
brew "pandoc"
brew "pv"
brew "rsync"
brew "smartmontools"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "telnet"
brew "tldr"
brew "trash" # Command for putting files (correctly) into the trash
brew "tree"
brew "wget"
brew "youtube-dl"

# Cask

cask "iterm2"
cask "hammerspoon"
cask "dash"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "hex-fiend"
cask "insomnia"
cask "skim"
cask "suspicious-package"
cask "marked"

## Quicklook Plugins
cask "qlmarkdown" # View formatted markdown in quicklook
cask "qlstephen" # View plaintext files in quicklook
cask "quicklook-csv"
cask "quicklook-json"
