# Languages
brew "go"
brew "node"
brew "python"
brew "ruby"

# Dev stuff
brew "ansible"
brew "cloc"
brew "cmake"
brew "direnv"
brew "fzf"
brew "git"
brew "hadolint"  # Dockerfile linter
brew "jq"
brew "macvim", args: ["HEAD"]
brew "make"
brew "pyenv"
brew "pyenv-virtualenv"
brew "shellcheck"
brew "tmux"
brew "universal-ctags"
brew "zsh"

# Utilities
brew "ffmpeg"
brew "gnupg"
brew "htop"
brew "httpie"
brew "iftop" # Bandwidth usage on an interface
brew "iperf3"
brew "mtr" # Combines traceroute and ping into a nice curses interface
brew "nmap"
brew "pv"
brew "rsync"
brew "ssh-copy-id"
brew "telnet"
brew "the_silver_searcher"
brew "tldr"
brew "trash" # Command for putting files (correctly) into the trash
brew "tree"
brew "wget"
